In [1]:
"""Preprocesses data for training.

Preferrably, run using Jupyter Notebook.
"""

import pandas as pd
import numpy as np

In [2]:
# Read raw data from the excel file.
raw_data = pd.read_excel(
    "data/ouse93-96-raw-data.xlsx",
    index_col=0,
    header=1,
    usecols='A:I'
)

In [3]:
# Convert columns to float values. Turn non-numeric values into np.nan.
for column in raw_data.columns[1:]:
    raw_data[column] = pd.to_numeric(raw_data[column], errors='coerce')

In [4]:
# Convert negative values into np.nan.
raw_data = raw_data.mask(raw_data < 0, np.nan)

In [5]:
# Print all rows with NAN values.
raw_data[raw_data.isna().any(axis=1)]

,Crakehill,Skip Bridge,Westwick,Skelton,Arkengarthdale,East Cowton,Malham Tarn,Snaizeholme
1993-02-13,NaN,5.476,11.051,30.73,0.0,0.0,0.0,0.0
1993-03-15,NaN,2.546,7.179,18.06,11.2,0.0,86.0,19.2
1993-03-16,NaN,2.494,7.232,17.16,0.8,0.0,12.8,8.0
1993-04-07,22.90,4.159,26.603,NaN,2.4,0.0,0.0,3.2
1993-04-27,24.40,11.684,22.181,73.96,NaN,0.0,0.0,0.0
1995-03-01,80.60,19.096,100.761,174.00,17.6,NaN,51.2,21.6
1996-02-09,12.70,NaN,7.576,20.58,0.0,37.6,12.0,14.4
1996-04-18,7.61,NaN,13.918,16.84,0.8,4.8,47.2,32.0

In [6]:
# Imputate spurious data.
raw_data = raw_data.interpolate(method="linear")

In [9]:
# Print all rows with NAN values.
raw_data[raw_data.isna().any(axis=1)]

Empty DataFrame
Columns: [Crakehill, Skip Bridge, Westwick, Skelton, Arkengarthdale, East Cowton, Malham Tarn, Snaizeholme]
Index: []